posts/am-i-back/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Am I back? | Emacsome</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://blank-manash.github.io/blog/posts/am-i-back/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Manash Baul">
<link rel="prev" href="../emacs-blogging%20/" title="Emacs Blogging" type="text/html">
<link rel="next" href="../rate-limiter/" title="Rate Limiter" type="text/html">
<meta property="og:site_name" content="Emacsome">
<meta property="og:title" content="Am I back?">
<meta property="og:url" content="https://blank-manash.github.io/blog/posts/am-i-back/">
<meta property="og:description" content="Am I back?


I am back to blogging after a long time. I have been busy with my work and a long time dissimilarity of leaving the world of linux to find other systems that the world. So I started to le">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2023-06-17T17:30:44+05:30">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../../">

            <span id="blog-title">Emacsome</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Am I back?</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    Manash Baul
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2023-06-17T17:30:44+05:30" itemprop="datePublished" title="2023-06-17 17:30">2023-06-17 17:30</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org5f05779" class="outline-2">
<h2 id="org5f05779">Am I back?</h2>
<div class="outline-text-2" id="text-org5f05779">
<p>
I am back to blogging after a long time. I have been busy with my work and a long time dissimilarity of leaving the world of linux to find other systems that the world. So I started to learn System Design in order to facilitate myself with all the other ways. I want to revive this blog as I no longer wonder about math support to be added.
</p>
</div>

<div id="outline-container-orgca0b6a8" class="outline-3">
<h3 id="orgca0b6a8">How to revive this blog?</h3>
<div class="outline-text-3" id="text-orgca0b6a8">
<p>
Admittedly, it was a big of discovery to find out how this blog actually worked. But to make sure that I can have it up and running again. Here is a bit of heads up on how to achieve that quick.
</p>
</div>

<div id="outline-container-org0237d8b" class="outline-4">
<h4 id="org0237d8b">Step 1: The Repository</h4>
<div class="outline-text-4" id="text-org0237d8b">
<p>
The repository is set up in <code>blank-manash/blog</code>. To start, simply clone it to your system. It contains 2 branches, <code>src</code> and <code>main</code>, the src is where we would be actively working on, and the <code>main</code> is from where the pages are published. Make sure you are checked out to the <code>src</code> branch when you are working on this.
</p>
</div>
</div>

<div id="outline-container-org265cab5" class="outline-4">
<h4 id="org265cab5">Step 2: Nikola</h4>
<div class="outline-text-4" id="text-org265cab5">
<p>
Install Nikola. The offical website asks you to install it using a venv. But the direct install through homebrew on my macbook works fine as well. Everything is already set up, you would want to run these commands.
</p>

<div class="highlight"><pre><span></span>pip3 install nikola ghp-import
</pre></div>
</div>
</div>

<div id="outline-container-org25e29f8" class="outline-4">
<h4 id="org25e29f8">Step 3: Edit</h4>
<div class="outline-text-4" id="text-org25e29f8">
<p>
Now you can simply get started by creating a new page from <code>nikola new_post -e</code>, <code>nikola build</code>, <code>nikola serve -b</code> and <code>nikola github_deploy</code>. It's self explanatory of what these things mean, but it really is that easy to get started with it.
</p>
</div>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul class="pager hidden-print">
<li class="previous">
                <a href="../emacs-blogging%20/" rel="prev" title="Emacs Blogging">Previous post</a>
            </li>
            <li class="next">
                <a href="../rate-limiter/" rel="next" title="Rate Limiter">Next post</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2023         <a href="mailto:mximpaid@gmail.com">Manash Baul</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element){var i=element.getElementsByTagName('img')[0];return i===undefined?'':i.alt;}});
    </script>
</body>
</html>
